# OBJExportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OBJExportOptions Constructor
OBJExportOptions Class See Also
---
Constructs a new instance of OBJExportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public OBJExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
OBJExportOptions()
```

# See Also
OBJExportOptions Class
OBJExportOptions Overload
Autodesk.Revit.DB Namespace